; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	thermograph2 - mode
	image3 - mode
	thermograph0 - mode
	image6 - mode
	spectrograph4 - mode
	thermograph1 - mode
	image5 - mode
	GroundStation1 - direction
	Star2 - direction
	GroundStation3 - direction
	Star4 - direction
	GroundStation0 - direction
	Star5 - direction
	Planet6 - direction
	Star7 - direction
	Planet8 - direction
	Planet9 - direction
	Planet10 - direction
	Phenomenon11 - direction
	Phenomenon12 - direction
	Planet13 - direction
)
(:init
	(supports instrument0 image5)
	(supports instrument0 thermograph2)
	(calibration_target instrument0 Star4)
	(supports instrument1 image6)
	(supports instrument1 thermograph1)
	(calibration_target instrument1 Star4)
	(supports instrument2 spectrograph4)
	(supports instrument2 image5)
	(supports instrument2 thermograph0)
	(supports instrument2 image3)
	(calibration_target instrument2 GroundStation0)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star7)
)
(:goal (and
	(pointing satellite0 Planet6)
	(have_image Star5 thermograph0)
	(have_image Planet6 thermograph1)
	(have_image Star7 image3)
	(have_image Star7 image6)
	(have_image Planet8 thermograph2)
	(have_image Planet9 thermograph1)
	(have_image Planet9 image6)
	(have_image Planet10 thermograph0)
	(have_image Planet10 image5)
	(have_image Phenomenon11 thermograph2)
	(have_image Phenomenon12 spectrograph4)
	(have_image Planet13 spectrograph4)
))

)

; plan
1. (turn_to satellite0 groundstation0 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 groundstation0)
   goals met: 0 of 13
2. (switch_on instrument2 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument2)
   goals met: 0 of 13
3. (calibrate satellite0 instrument2 groundstation0)
   added: (calibrated instrument2)
   goals met: 0 of 13
4. (turn_to satellite0 star7 groundstation0)
   deleted: (pointing satellite0 groundstation0)
   added: (pointing satellite0 star7)
   goals met: 0 of 13
5. (take_image satellite0 star7 instrument2 image3)
   added: (have_image star7 image3)
   goals met: 1 of 13
6. (turn_to satellite0 star5 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 star5)
   goals met: 1 of 13
7. (take_image satellite0 star5 instrument2 thermograph0)
   added: (have_image star5 thermograph0)
   goals met: 2 of 13
8. (turn_to satellite0 planet13 star5)
   deleted: (pointing satellite0 star5)
   added: (pointing satellite0 planet13)
   goals met: 2 of 13
9. (take_image satellite0 planet13 instrument2 spectrograph4)
   added: (have_image planet13 spectrograph4)
   goals met: 3 of 13
10. (turn_to satellite0 planet10 planet13)
   deleted: (pointing satellite0 planet13)
   added: (pointing satellite0 planet10)
   goals met: 3 of 13
11. (take_image satellite0 planet10 instrument2 thermograph0)
   added: (have_image planet10 thermograph0)
   goals met: 4 of 13
12. (take_image satellite0 planet10 instrument2 image5)
   added: (have_image planet10 image5)
   goals met: 5 of 13
13. (turn_to satellite0 phenomenon12 planet10)
   deleted: (pointing satellite0 planet10)
   added: (pointing satellite0 phenomenon12)
   goals met: 5 of 13
14. (take_image satellite0 phenomenon12 instrument2 spectrograph4)
   added: (have_image phenomenon12 spectrograph4)
   goals met: 6 of 13
15. (switch_off instrument2 satellite0)
   deleted: (power_on instrument2)
   added: (power_avail satellite0)
   goals met: 6 of 13
16. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 6 of 13
17. (turn_to satellite0 star4 phenomenon12)
   deleted: (pointing satellite0 phenomenon12)
   added: (pointing satellite0 star4)
   goals met: 6 of 13
18. (calibrate satellite0 instrument0 star4)
   added: (calibrated instrument0)
   goals met: 6 of 13
19. (turn_to satellite0 phenomenon11 star4)
   deleted: (pointing satellite0 star4)
   added: (pointing satellite0 phenomenon11)
   goals met: 6 of 13
20. (take_image satellite0 phenomenon11 instrument0 thermograph2)
   added: (have_image phenomenon11 thermograph2)
   goals met: 7 of 13
21. (turn_to satellite0 planet8 phenomenon11)
   deleted: (pointing satellite0 phenomenon11)
   added: (pointing satellite0 planet8)
   goals met: 7 of 13
22. (take_image satellite0 planet8 instrument0 thermograph2)
   added: (have_image planet8 thermograph2)
   goals met: 8 of 13
23. (switch_off instrument0 satellite0)
   deleted: (power_on instrument0)
   added: (power_avail satellite0)
   goals met: 8 of 13
24. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 8 of 13
25. (turn_to satellite0 star4 planet8)
   deleted: (pointing satellite0 planet8)
   added: (pointing satellite0 star4)
   goals met: 8 of 13
26. (calibrate satellite0 instrument1 star4)
   added: (calibrated instrument1)
   goals met: 8 of 13
27. (turn_to satellite0 planet9 star4)
   deleted: (pointing satellite0 star4)
   added: (pointing satellite0 planet9)
   goals met: 8 of 13
28. (take_image satellite0 planet9 instrument1 image6)
   added: (have_image planet9 image6)
   goals met: 9 of 13
29. (take_image satellite0 planet9 instrument1 thermograph1)
   added: (have_image planet9 thermograph1)
   goals met: 10 of 13
30. (turn_to satellite0 star7 planet9)
   deleted: (pointing satellite0 planet9)
   added: (pointing satellite0 star7)
   goals met: 10 of 13
31. (take_image satellite0 star7 instrument1 image6)
   added: (have_image star7 image6)
   goals met: 11 of 13
32. (turn_to satellite0 planet6 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 planet6)
   goals met: 12 of 13
33. (take_image satellite0 planet6 instrument1 thermograph1)
   added: (have_image planet6 thermograph1)
   goals met: 13 of 13
